# 8.PANDAS SQL 1 & SQL 2-Assignment-1

Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/
Rename the columns as per the description from this file:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names
Task:
Create a sql db from adult dataset and name it sqladb

In [1]:
import pandas as pd
adult_df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
adult_df.head(5)

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

# Rename Columns

In [3]:
adult_df.columns =["Age","JobType","Number","Education","Education_code","Marital_Status"
                ,"Occupation","Relationship","Race","Sex","Capital_Gain","Capital_Loss","Hours_Per_Week",
                "Country","Income"]
adult_df.head(5)

,Age,JobType,Number,Education,Education_code,Marital_Status,Occupation,Relationship,Race,Sex,Capital_Gain,Capital_Loss,Hours_Per_Week,Country,Income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

# Task: Create a sql db from adult dataset and name it sqladb

In [4]:
import sqlalchemy
from sqlalchemy import create_engine

sql_engine = create_engine('sqlite:///sqladb', echo=True)
adult_df.to_sql('sqladb', sql_engine, if_exists='replace')

2019-01-19 20:46:08,703 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2019-01-19 20:46:08,704 INFO sqlalchemy.engine.base.Engine ()
2019-01-19 20:46:08,706 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2019-01-19 20:46:08,706 INFO sqlalchemy.engine.base.Engine ()
2019-01-19 20:46:08,707 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("sqladb")
2019-01-19 20:46:08,708 INFO sqlalchemy.engine.base.Engine ()
2019-01-19 20:46:08,711 INFO sqlalchemy.engine.base.Engine
CREATE TABLE sqladb (
	"index" BIGINT,
	"Age" BIGINT,
	"JobType" TEXT,
	"Number" BIGINT,
	"Education" TEXT,
	"Education_code" BIGINT,
	"Marital_Status" TEXT,
	"Occupation" TEXT,
	"Relationship" TEXT,
	"Race" TEXT,
	"Sex" TEXT,
	"Capital_Gain" BIGINT,
	"Capital_Loss" BIGINT,
	"Hours_Per_Week" BIGINT,
	"Country" TEXT,
	"Income" TEXT
)


2019-01-19 20:46:08,711 INFO sqlalchemy.engine.base.Engine ()
2019-01-19 20:46:08,805 INFO sqlalchemy.engine.base.Engine COMMIT
2019-01-19 20:46:08,808 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_sqladb_index ON sqladb ("index")
2019-01-19 20:46:08,811 INFO sqlalchemy.engine.base.Engine ()
2019-01-19 20:46:08,913 INFO sqlalchemy.engine.base.Engine COMMIT
2019-01-19 20:46:08,959 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2019-01-19 20:46:09,391 INFO sqlalchemy.engine.base.Engine INSERT INTO sqladb ("index", "Age", "JobType", "Number", "Education", "Education_code", "Marital_Status", "Occupation", "Relationship", "Race", "Sex", "Capital_Gain", "Capital_Loss", "Hours_Per_Week", "Country", "Income") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2019-01-19 20:46:09,392 INFO sqlalchemy.engine.base.Engine ((0, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (1, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (2, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (4, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (5, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (6, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K'), (7, 31, ' Private', 45781, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 14084, 0, 50, ' United-States', ' >50K')  ... displaying 10 of 32560 total bound parameter sets ...  (32558, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32559, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))
2019-01-19 20:46:09,568 INFO sqlalchemy.engine.base.Engine COMMIT

# Q1. Select 10 records from the adult sqladb

In [7]:
import sqlite3
connection = sqlite3.connect("sqladb")
cursor = connection.cursor()
print(pd.read_sql_query('SELECT * FROM sqladb limit 5', connection))

   index  Age            JobType  Number   Education  Education_code  \
0      0   50   Self-emp-not-inc   83311   Bachelors              13
1      1   38            Private  215646     HS-grad               9
2      2   53            Private  234721        11th               7
3      3   28            Private  338409   Bachelors              13
4      4   37            Private  284582     Masters              14

        Marital_Status          Occupation    Relationship    Race      Sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   Capital_Gain  Capital_Loss  Hours_Per_Week         Country  Income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

# Q2. Show me the average hours per week of all men who are working in private sector

In [10]:
cursor.execute('SELECT avg(Hours_Per_Week) FROM sqladb WHERE JobType=" Private"')
result = cursor.fetchall()
print("Average Hours Per week of all Men who are working in Private Sector is : ",result[0][0])

Average Hours Per week of all Men who are working in Private Sector is :  40.267095523440254

# Q3. Show me the frequency table for education, occupation and relationship, separately

In [16]:
cursor.execute('SELECT Education, COUNT(*) cnt FROM sqladb GROUP BY Education order by cnt desc')
result = cursor.fetchall()
for data in result:
    print(data[0], data[1])

 HS-grad 10501
 Some-college 7291
 Bachelors 5354
 Masters 1723
 Assoc-voc 1382
 11th 1175
 Assoc-acdm 1067
 10th 933
 7th-8th 646
 Prof-school 576
 9th 514
 12th 433
 Doctorate 413
 5th-6th 333
 1st-4th 168
 Preschool 51

In [18]:
cursor.execute('SELECT Occupation, COUNT(*) cnt FROM sqladb GROUP BY Occupation order by cnt desc')
result = cursor.fetchall()
for data in result:
    print(data[0], data[1])

 Prof-specialty 4140
 Craft-repair 4099
 Exec-managerial 4066
 Adm-clerical 3769
 Sales 3650
 Other-service 3295
 Machine-op-inspct 2002
 ? 1843
 Transport-moving 1597
 Handlers-cleaners 1370
 Farming-fishing 994
 Tech-support 928
 Protective-serv 649
 Priv-house-serv 149
 Armed-Forces 9

In [21]:
cursor.execute('SELECT Relationship, COUNT(*) as cnt FROM sqladb GROUP BY Relationship order by cnt desc')
result = cursor.fetchall()
for data in result:
    print(data[0], data[1])

 Husband 13193
 Not-in-family 8304
 Own-child 5068
 Unmarried 3446
 Wife 1568
 Other-relative 981

# Q4. Are there any people who are married, working in private sector and having a masters degree

In [22]:
print(pd.read_sql_query('SELECT * FROM sqladb WHERE Education=" Masters" AND JobType=" Private" AND Marital_Status=" Married-civ-spouse"',
                        connection).head(5))

   index  Age   JobType  Number Education  Education_code  \
0      4   37   Private  284582   Masters              14
1     86   33   Private  202051   Masters              14
2     99   76   Private  124191   Masters              14
3    187   31   Private   99928   Masters              14
4    197   35   Private  138992   Masters              14

        Marital_Status        Occupation     Relationship    Race      Sex  \
0   Married-civ-spouse   Exec-managerial             Wife   White   Female
1   Married-civ-spouse    Prof-specialty          Husband   White     Male
2   Married-civ-spouse   Exec-managerial          Husband   White     Male
3   Married-civ-spouse    Prof-specialty             Wife   White   Female
4   Married-civ-spouse    Prof-specialty   Other-relative   White     Male

   Capital_Gain  Capital_Loss  Hours_Per_Week         Country  Income
0             0             0              40   United-States   <=50K
1             0             0              50   United-States   <=50K
2             0             0              40   United-States    >50K
3             0             0              50   United-States   <=50K
4          7298             0              40   United-States    >50K

# Q5. What is the average, minimum and maximum age group for people working in different sectors

In [24]:
cursor.execute('SELECT occupation, min(age),max(age),avg(age) FROM sqladb GROUP BY occupation')
result = cursor.fetchall()
for data in result:
    print(data[0], data[1], data[2], data[3])

 ? 17 90 40.882799782962564
 Adm-clerical 17 90 36.96391615813213
 Armed-Forces 23 46 30.22222222222222
 Craft-repair 17 90 39.03147109050988
 Exec-managerial 17 90 42.16920806689621
 Farming-fishing 17 90 41.2112676056338
 Handlers-cleaners 17 90 32.16569343065694
 Machine-op-inspct 17 90 37.71528471528472
 Other-service 17 90 34.94962063732929
 Priv-house-serv 17 81 41.7248322147651
 Prof-specialty 17 90 40.51763285024155
 Protective-serv 17 90 38.9537750385208
 Sales 17 90 37.353972602739724
 Tech-support 17 73 37.022629310344826
 Transport-moving 17 90 40.19787100814026

# Q6. Calculate age distribution by country

In [18]:
cursor.execute('SELECT Native_Country, min(age),max(age),avg(age) FROM sqladb GROUP BY Native_Country')
output = cursor.fetchall()
display(output)

[(' ?', 17, 90, 38.72555746140652),
 (' Cambodia', 18, 65, 37.78947368421053),
 (' Canada', 17, 80, 42.54545454545455),
 (' China', 22, 75, 42.53333333333333),
 (' Columbia', 18, 75, 39.71186440677966),
 (' Cuba', 21, 82, 45.76842105263158),
 (' Dominican-Republic', 18, 78, 37.72857142857143),
 (' Ecuador', 21, 90, 36.642857142857146),
 (' El-Salvador', 17, 79, 34.132075471698116),
 (' England', 17, 90, 41.15555555555556),
 (' France', 20, 64, 38.96551724137931),
 (' Germany', 18, 74, 39.25547445255474),
 (' Greece', 22, 65, 46.206896551724135),
 (' Guatemala', 19, 66, 32.421875),
 (' Haiti', 17, 63, 38.27272727272727),
 (' Holand-Netherlands', 32, 32, 32.0),
 (' Honduras', 18, 58, 33.84615384615385),
 (' Hong', 19, 60, 33.65),
 (' Hungary', 24, 81, 49.38461538461539),
 (' India', 17, 61, 38.09),
 (' Iran', 22, 63, 39.41860465116279),
 (' Ireland', 23, 68, 36.458333333333336),
 (' Italy', 19, 77, 46.42465753424658),
 (' Jamaica', 18, 66, 35.592592592592595),
 (' Japan', 19, 61, 38.24193548387097),
 (' Laos', 19, 56, 34.72222222222222),
 (' Mexico', 17, 81, 33.29082426127527),
 (' Nicaragua', 19, 67, 33.61764705882353),
 (' Outlying-US(Guam-USVI-etc)', 21, 63, 38.714285714285715),
 (' Peru', 17, 69, 35.25806451612903),
 (' Philippines', 17, 90, 39.44444444444444),
 (' Poland', 17, 85, 43.11666666666667),
 (' Portugal', 19, 78, 40.2972972972973),
 (' Puerto-Rico', 17, 90, 40.50877192982456),
 (' Scotland', 18, 62, 40.416666666666664),
 (' South', 19, 90, 38.75),
 (' Taiwan', 20, 61, 33.8235294117647),
 (' Thailand', 19, 55, 34.94444444444444),
 (' Trinadad&Tobago', 17, 61, 41.31578947368421),
 (' United-States', 17, 90, 38.65566183276766),
 (' Vietnam', 19, 73, 34.059701492537314),
 (' Yugoslavia', 20, 66, 38.8125)]

# Q7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and 'capital-loss'

In [19]:
cursor.execute('UPDATE sqladb SET capital_gain=capital_gain-capital_loss')

In [20]:
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  Age          WorkClass  SomeNumer   Education  Education_Number  \
0      0   50   Self-emp-not-inc      83311   Bachelors                13
1      1   38            Private     215646     HS-grad                 9
2      2   53            Private     234721        11th                 7
3      3   28            Private     338409   Bachelors                13
4      4   37            Private     284582     Masters                14

        Marital_Status          Occupation    Relationship    Race      Sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   Capital_Gain  Capital_Loss  Hours_Per_Week  Native_Country  Income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

In [21]:

connection.close()